Autodesk.Revit.DB.ShapeImporterSourceFormat.STL
The incoming data is in STL format (*.stl).

Autodesk.Revit.DB.ShapeImporterSourceFormat.OBJ
The incoming data is in OBJ format (*.obj).

Autodesk.Revit.DB.ShapeImporterSourceFormat.SketchUp
The incoming data is in SketchUp format (*.skp).